<?php

#
const CHINA_MOBILE = 1; //中国移动
const CHINA_TEL    = 2; //中国电信
const CHINA_UNION  = 3; //中国联通


# 各运营商号段，20201123更新
$ISP_PHONE_PREX = [
    CHINA_MOBILE => [
        139, 138, 137, 136, 135, 134, 147, 150, 151, 152, 157, 158, 159, 182, 183, 184, 187, 188, 178, 198, 172, 195, 197
    ],
    CHINA_TEL    => [
        133, 153, 180, 181, 189, 199, 177, 173, 190, 191, 193
    ],
    CHINA_UNION  => [
        130, 131, 132, 155, 156, 185, 186, 175, 176, 145, 166, 196
    ]
    //192 中国广电
    //167 联通转售
    //146号段是中国联通物联网专属号段
    //149电信物联网
    //148 移动物联网
]; 


var_dump($ISP_PHONE_PREX[CHINA_MOBILE]);
